; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph3 - mode
	infrared2 - mode
	thermograph1 - mode
	image0 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	GroundStation2 - direction
	GroundStation6 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet13)
)
(:goal (and
	(pointing satellite0 Star12)
	(have_image Star8 image0)
	(have_image Planet9 thermograph1)
	(have_image Phenomenon10 infrared2)
	(have_image Phenomenon11 spectrograph3)
	(have_image Star12 spectrograph3)
	(have_image Planet13 spectrograph3)
	(have_image Star14 image0)
	(have_image Star15 thermograph1)
	(have_image Phenomenon16 thermograph1)
))

)

; plan
1. (turn_to satellite0 groundstation2 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 10
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 10
4. (turn_to satellite0 planet9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet9)
   goals met: 0 of 10
5. (take_image satellite0 planet9 instrument0 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 1 of 10
6. (turn_to satellite0 phenomenon16 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon16)
   goals met: 1 of 10
7. (take_image satellite0 phenomenon16 instrument0 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 2 of 10
8. (turn_to satellite0 phenomenon10 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 10
9. (take_image satellite0 phenomenon10 instrument0 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 3 of 10
10. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 10
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 10
12. (turn_to satellite0 groundstation6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation6)
   goals met: 3 of 10
13. (calibrate satellite0 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 3 of 10
14. (turn_to satellite0 phenomenon11 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 10
15. (take_image satellite0 phenomenon11 instrument1 spectrograph3)
   added: (have_image phenomenon11 spectrograph3)
   goals met: 4 of 10
16. (turn_to satellite0 planet13 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet13)
   goals met: 4 of 10
17. (take_image satellite0 planet13 instrument1 spectrograph3)
   added: (have_image planet13 spectrograph3)
   goals met: 5 of 10
18. (turn_to satellite0 star14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star14)
   goals met: 5 of 10
19. (take_image satellite0 star14 instrument1 image0)
   added: (have_image star14 image0)
   goals met: 6 of 10
20. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 6 of 10
21. (take_image satellite0 star15 instrument1 thermograph1)
   added: (have_image star15 thermograph1)
   goals met: 7 of 10
22. (turn_to satellite0 star8 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star8)
   goals met: 7 of 10
23. (take_image satellite0 star8 instrument1 image0)
   added: (have_image star8 image0)
   goals met: 8 of 10
24. (turn_to satellite0 star12 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star12)
   goals met: 9 of 10
25. (take_image satellite0 star12 instrument1 spectrograph3)
   added: (have_image star12 spectrograph3)
   goals met: 10 of 10
